backwardFacingStep/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel    Newtonian;

nu    [0 2 -1 0 0 0 0]    3.5e-06;

D_n    [0 2 -1 0 0 0 0]    1.58e-11;

D_a    [0 2 -1 0 0 0 0]    1.58e-11;

D_ADP    [0 2 -1 0 0 0 0]    2.37e-10;

C    [0 0 0 0 0 0 0]    1.4854e-07;

alpha    [0 0 0 0 0 0 0]    1.4854;

beta    [0 0 0 0 0 0 0]    1.4401;

kCon    [0 2 0 0 0 0 0]    9.56e-16;

A    [0 0 0 0 1 0 0]    3.0e-17;

alpha_eps    [0 3 -1 0 0 0 0]    3.7e-11;

B    [0 0 -1 0 0 0 0]    2.0e03;

ADP_t    [0 -3 0 0 1 0 0]    1.2e18;

t_ADP    [0 0 1 0 0 0 0]     1;

tau_low_wall    [1 -1 -2 0 0 0 0]    2.0e-02;

tau_high_wall    [1 -1 -2 0 0 0 0]    1.5e-01;

tau_bd_wall    [1 -1 -2 0 0 0 0]    8.0e-01;

tau_low_thr    [1 -1 -2 0 0 0 0]    1.0e-01;

tau_high_thr    [1 -1 -2 0 0 0 0]    3.0e-01;

tau_bd_thr    [1 -1 -2 0 0 0 0]    9.0e-01;

eps_t    [0 -3 0 0 0 0 0]    5.25e18;

phi_ai    [0 -3 0 0 0 0 0]    25.0e12;

phi_ni    [0 -3 0 0 0 0 0]    475.0e12;

rho    [1 -3 0 0 0 0 0]    1.06e03;

R_ADP    [0 0 0 0 0 0 0]    3e-17;

// ************************************************************************* //
