backwardFacingStep/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver           PCG;
        preconditioner   DIC;
        tolerance        1e-06;
        relTol           0.05;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    U
    {
        solver           PBiCG;
        preconditioner   DILU;
        tolerance        1e-06;
        relTol           0;
    }
    
    phi_a
    {
        solver           PBiCG;
        preconditioner   DILU;
        tolerance        1e-06;
        relTol           0;
    }
    
    phi_n
    {
        solver           PBiCG;
        preconditioner   DILU;
        tolerance        1e-06;
        relTol           0;
    }
    
    ADP
    {
        solver           PBiCG;
        preconditioner   DILU;
        tolerance        1e-06;
        relTol           0;
    }
    
    epsilon
    {
        solver           PBiCG;
        preconditioner   DILU;
        tolerance        1e-06;
        relTol           0;
    }
}

PISO
{
    nNonOrthogonalCorrectors 0;
    nCorrectors         2;
    pRefCell            0;
    pRefValue           0;
}


// ************************************************************************* //
